var position = {
  45: {
    x: {
      start: 89,
      size: 60,
      gap: 15 
    },
    y: {
      pos: [99, 193, 273, 353, 447, 527, 607, 687, 767, 847, 940, 1020, 1100, 1194, 1288],
      size: 60
    }
  },
  46: {
    x: {
      start: 97,
      size: 60,
      gap: 15 
    },
    y: {
      pos: [101, 195, 289, 369, 449, 543, 623, 703, 783, 863, 943, 1037, 1117, 1211, 1305],
      size: 58
    }
  },
  47: {
    x: {
      start: 96,
      size: 50,
      gap: 30 
    },
    y: {
      pos: [215, 295, 372, 448, 534, 614, 694, 774, 854, 933, 1013, 1093, 1175, 1255],
      size: 50
    }
  },
  48: {
    x: {
      start: 95,
      size: 50,
      gap: 30
    },
    y: {
      pos: [134, 215, 295, 375, 456, 535, 615, 695, 775, 855, 935],
      size: 50
    }
  }
};

var song_position = {
  45: {
      88134730: [0,  0], // 天上の星 〜黎明記〜EX
     868173032: [1,  0], // Strobe♡GirlEX
    2946874278: [2,  0], // 乱れた風紀に天罰をEX
    1299214763: [3,  0], // 532nmEX
    2881840138: [4,  0], // マインド・ゲームEX

    2013602325: [0,  1], // エイプリルフールの唄EX
     389630102: [1,  1], // popdodEX
     983377637: [2,  1], // Symsonic BreezeEX
    2404432328: [3,  1], // Looking for...EX
    2664988669: [4,  1], // moffingEX
     689007760: [5,  1], // UPBEATEX
    2083516735: [6,  1], // FantasiaEX
     818561687: [7,  1], // OVER THE LIMIT!EX
    3576506295: [8,  1], // EmpatheticEX
    2256023829: [9,  1], // Apple ButterEX

    2671351841: [0,  2], // 旗EX
    1000697507: [1,  2], // プロキオンの騎士団EX
     937008926: [2,  2], // シュレーディンガーの猫HYPER
    3240772225: [3,  2], // Second HeavenEX
    1845827397: [4,  2], // Stardust WanderersEX
    3379528469: [5,  2], // starmine (pop'n mixxx)EX
    1834151729: [6,  2], // Let's go out!EX
    3753277097: [7,  2], // flutterEX
    4048092026: [8,  2], // ANAHONIKUY -雪の華PuzzLeMix-EX
    1416836834: [9,  2], // くさびかたびら☆下克上! 〜 暗躍の樹海ＭＩＸEX

    1908704583: [0,  3], // 321 STARSEX

    1674397346: [0,  4], // 歌劇 月夜のアラビアEX
     635683369: [1,  4], // デッドボヲルdeホームランEX
    2888536840: [2,  4], // Pop'n Xmas 2004 〜電子ノウタゴエ〜EX
    2817821108: [3,  4], // テンプラ揚三HYPER
      88134730: [4,  4], // 天上の星 〜黎明記〜EX
    3699051659: [5,  4], // セレクトショップに横たわるネコEX
     687539418: [6,  4], // ７７７EX
    3997444504: [7,  4], // FlowEX
     721284081: [8,  4], // 朧EX
    3875465021: [9,  4], // 水面静かに大地の烈日わたらせてEX

    2288052152: [0,  5], // snow prismEX
      82261937: [1,  5], // Hell? or Heaven?HYPER
    3571156226: [2,  5], // 探検ノートEX
    1515383486: [3,  5], // 暗黒サイケデリックEX
    4207926411: [4,  5], // すわひでおのゴロゴロ年号覚え唄決定版EX
    3746504314: [5,  5], // GRADIUS -FULL SPEED-EX
    1750447291: [6,  5], // HEAT-BIT-HIT-BEATEX
    1722244195: [7,  5], // 流EX
    3975950575: [8,  5], // 個胃X光EX
    1056753918: [9,  5], // JackEX

    3907876611: [0,  6], // 鳳凰EX
    1513890547: [1,  6], // 想い出をありがとうHYPER
    3842721284: [2,  6], // 紅焔EX
    3854948485: [3,  6], // microwave popcornEX
     988324664: [4,  6], // 悪魔城ドラキュラメドレー〜ハイブリッド・ヴァージョン〜EX
    3286837317: [5,  6], // MYEX
    3100077128: [6,  6], // アルパカ☆BoooingEX

    3012491304: [0,  7], // ポップミュージック論EX
    4150850842: [1,  7], // Gamelan de CoupleEX
    3654341161: [2,  7], // 彙電子奏叉EX
     786541712: [3,  7], // ☆shining☆EX
    1486836237: [4,  7], // こなもん屋人情歌EX
     754218485: [5,  7], // VERSUS!!EX
    3985765641: [6,  7], // rottel-da-sunEX
     512977147: [7,  7], // 水鏡EX
    1858631559: [8,  7], // BRE∀K DOWN!EX
    1752437834: [9,  7], // SHIONEX

     147827128: [0,  8], // Treasure HoardEX
     699613058: [1,  8], // draw!!!!EX
    1608004741: [2,  8], // 少年リップルズEX
      36876359: [3,  8], // 紅ノ桃EX
     761094132: [4,  8], // Infinity BlueEX
    2696149925: [5,  8], // SA-DA-MEEX
    1033729655: [6,  8], // 月雪に舞う花のようにEX
    1473099196: [7,  8], // Klungkung 1655EX
     970885070: [8,  8], // 突確全回転！EX
    1948102445: [9,  8], // カリスマ（ゲームサイズ）EX

     149794275: [0,  9], // Broadway DivaEX
    3599080236: [1,  9], // ヒデオ体操第一EX
    3038646044: [2,  9], // Tree in Lake 〜消えたチチカカの木〜EX
    2403408063: [3,  9], // ArrabbiataEX
     924449602: [4,  9], // SUN/光線EX
    4251291288: [5,  9], // attack in the minor keyEX
    3206274988: [6,  9], // 駕篭の鳥EX

     882169986: [0, 10], // MärchenEX
    3333431771: [1, 10], // チカラEX
    3380267987: [2, 10], // Votum　stellarumEX
    1833501729: [3, 10], // kaleidoscopeEX
    3431020876: [4, 10], // 大見解EX
    2847000921: [5, 10], // イブの時代っ！EX
    2534078335: [6, 10], // 偽りのアルカディアEX
    1874313034: [7, 10], // TRINITY ARROWEX
    3059068172: [8, 10], // Marigold (Jazzy Hip-Hop Remix)EX
    3260973076: [9, 10], // The Sealer 〜ア・ミリアとミリアの民〜EX

    1379713015: [0, 11], // 24時間のヒーローEX
     392237277: [1, 11], // Ignited NightEX
    1230558942: [2, 11], // 登山者たちEX
    2873657111: [3, 11], // Blind Justice 〜Torn souls, Hurt Faiths 〜EX
    1151364173: [4, 11], // Destiny LoversEX
    3905932158: [5, 11], // On Your MarkEX
     221194464: [6, 11], // Passacaglia（J-RAVE MIX）EX
    2885880615: [7, 11], // KHAMEN BREAKEX
    2138633038: [8, 11], // レトロ男爵の嘆きEX
    1279140394: [9, 11], // AquaEX

     321562173: [0, 12], // MY GIFTSEX
     725961496: [1, 12], // LOL！EX
    3755974462: [2, 12], // FUNKY SUMMER BEACHEX
    4152673697: [3, 12], // 滅亡天使 † にこきゅっぴんEX
    3953868978: [4, 12], // 春風ブローインウィンドEX
    1569826802: [5, 12], // AKATSUKIEX

     171376086: [0, 13], // 戦場のアップデートEX

    2775718348: [0, 14], // StruggleEX
     358310986: [1, 14], // Who done it?!EX
  },
  46: {
     102357281: [0,  0], // INFINITYEX

    2207342268: [0,  1], // Hatcha Metcha PartyEX
    3297722110: [1,  1], // 明鏡止水EX
    2380239791: [2,  1], // 乙女繚乱 舞い咲き誇れEX

     970029385: [0,  2], // HabitsEX
     235475482: [1,  2], // AlicyEX
    1331911131: [2,  2], // Engraved MarkEX
    4080376717: [3,  2], // EchoesEX
    1346696437: [4,  2], // Daily Lunch SpecialEX
    3258507029: [5,  2], // 雷君EX
    2017543347: [6,  2], // PRANAEX
    4214056139: [7,  2], // めうめうぺったんたん！！EX
    1870338357: [8,  2], // DesireEX
     436691855: [9,  2], // 緋月の狂想曲EX

    2268646452: [0,  3],// GALAXY FOREST 11.6&12HYPER
    2068585270: [1,  3],// L'eternitaEX
    3879762581: [2,  3],// ギターケンドーEX
    4043459976: [3,  3],// Magical 4EX
    1484831446: [4,  3],// 鳳凰〜Chinese Phoenix Mix〜EX
    3947139487: [5,  3],// willEX
    2366401257: [6,  3],// 烏EX
    3804231802: [7,  3],// Les VagueEX
    3822427267: [8,  3],// IMPLANTATIONEX
    3969765811: [9,  3],// 黒髪乱れし修羅となりてEX

     984962660: [0,  4], // キャトられ♥恋はモ〜モクEX
     729816648: [1,  4], // 徹頭徹尾Thrive at Perfect FourthEX
    1522533674: [2,  4], // 魔界！痛快！ヘルダンスEX
    3533710046: [3,  4], // 超恋愛☆エクストリーム・ガールEX
    4108393771: [4,  4], // アルストロメリアEX

    4039717947: [0,  5], // 零と弌の鍵の唄EX
    1044626227: [1,  5], // BabeL 〜Next Story〜HYPER
    2339503966: [2,  5], // coffee breakEX
    3611647506: [3,  5], // 繚乱ヒットチャートEX
    3834248221: [4,  5], // ガッテンだ！！EX
    1896801323: [5,  5], // 曼珠沙華EX
    4222213917: [6,  5], // 鳥無き島にてEX
    1294341519: [7,  5], // 永遠という名の媚薬 〜Pyramid Power・Death Match ver.〜EX
    1733512851: [8,  5], // 西麻布水道曲EX
     894673850: [9,  5], // Stella SinistraEX

    2502430752: [0,  6], // 流星☆ハニー Perforation MixEX
    3006775321: [1,  6], // HYENAEX
    2977388001: [2,  6], // School LifeEX
    3720132570: [3,  6], // Deep MagentaEX
    2187582886: [4,  6], // TOXIC VIBRATIONEX
    3532586361: [5,  6], // SPICY PIECE (Ryu☆Remix)EX
    4071772727: [6,  6], // シャムシールの舞EX
    2236919398: [7,  6], // UNBOUND MINDEX
    2717558869: [8,  6], // Riot of ColorEX
    2906084274: [9,  6], // The Zoo ZoneEX

    2305490350: [0,  7], // MOONEX
    1968457962: [1,  7], // 恋はどう？モロ◎波動OK☆方程式！！EX
    3580759286: [2,  7], // Psyche Planet-VEX
    2762331470: [3,  7], // ColorsEX
    3387331901: [4,  7], // つばめEX
    3499822011: [5,  7], // 明日への誓いEX
    1405128459: [6,  7], // 辞世テンプレートEX
     728289781: [7,  7], // Soul On FireEX
    2855689593: [8,  7], // Kicky Kemari KickerEX
     155269729: [9,  7], // プリンシプルEX

    3051655847: [0,  8], // μ9EX
    3314700590: [1,  8], // ポチコの幸せな日常EX
    1723998177: [2,  8], // 路男EX
    3812395243: [3,  8], // 疾風EX
     757244547: [4,  8], // 怒れる大きな白い馬〜S.S.D.の役〜EX
    2044757235: [5,  8], // Shining WizardEX
      92746367: [6,  8], // Synergy For AngelsEX
    3329001936: [7,  8], // 左脳スパークEX
    2454703024: [8,  8], // 麗破唖甦〜rebirth〜EX
    3628013156: [9,  8], // GreeningEX

    3192552102: [0,  9], // demolizioneEX
    3806960479: [1,  9], // CassandraEX
    1888996144: [2,  9], // The Sky of SadnessEX
    3047816402: [3,  9], // 青春の扉EX
    3876405374: [4,  9], // サヨナラ・ヘヴンEX
    1991591215: [5,  9], // ペリーでぇす！EX
    2487050799: [6,  9], // IKKI! ExplosionEX
    2848310495: [7,  9], // カタルシスの月EX
     886722854: [8,  9], // アンデスの太陽EX
    2628585687: [9,  9], // 幸せを謳う詩EX

     168548576: [0, 10], // 蒼い弓箭EX
    2721893986: [1, 10], // De-a lungul vietiiEX
    2357770378: [2, 10], // CURUSEX
     751810466: [3, 10], // 朱と碧のランページEX
    3964059783: [4, 10], // pureEX

    3840424285: [0, 11], // brave!EX
    4243200611: [1, 11], // 洟・月・奇蹟EX
    2568203712: [2, 11], // GradationEX
    4189795701: [3, 11], // ラピストリアの約束EX
    4076506214: [4, 11], // 憂恋☆アクティベーションEX
     377756924: [5, 11], // NEW PEOPLEEX
    3996718011: [6, 11], // †渚の小悪魔ラヴリィ〜レイディオ†EX
    2633294391: [7, 11], // Ensamble Forecast 3/28EX
    3629652710: [8, 11], // レトロスペクト路EX
    3576802404: [9, 11], // 滅びに至るエランプシスEX

     954847101: [0, 12], // キルトEX
    3446754962: [1, 12], // 凛として咲く花の如くEX
    1626954209: [2, 12], // BAROQUE HOEDOWNEX
    1502994728: [3, 12], // ABSOLUTEEX

      89480131: [0, 13], // 異能対決!VS.淀ジョルEX
    4203834287: [1, 13], // Earth BeatEX

     124179138: [0, 14], // ice crystalsEX
    1766396794: [1, 14], // Dimension GaleEX
     911974034: [2, 14], // √太陽系◎ドーナツ化計画∞∀∞EX
    3740427014: [3, 14], // 水月鏡花のコノテーションEX
    2460302751: [4, 14], // 妖隠し -あやかしかくし-EX
    1325209711: [5, 14], // 千年ノ理EX

    // 3000240251: // EBONY & IVORYEX
  },
  47: {
    1667142875: [0,  0], // MynarcoEX
    1016166255: [1,  0], // chilblainEX
    1070308542: [2,  0], // Dogu DittyEX
     285808417: [3,  0], // へんたいトリロジーEX
    2550906931: [4,  0], // StoriesEX
    2909291949: [5,  0], // この子の七つのお祝いにEX
    2945732184: [6,  0], // 猿の経EX
     711438224: [7,  0], // ミサコの日記（見ちゃダメ！）EX

     650530290: [0,  1], // でんがなマンガナEX
    1997864116: [1,  1], // αρχηEX
     902016413: [2,  1], // 永遠という名の媚薬EX
      43679469: [3,  1], // 龍と少女とデコヒーレンスEX
     275108854: [4,  1], // うたEX
    2126067246: [5,  1], // For Dear 〜EX
    2126819391: [6,  1], // AmalgamationEX
    3604178582: [7,  1], // full-consciousness greenEX

     433576325: [0,  2], // お米の美味しい炊き方、そしてお米を食べることによるその効果。EX
      34685774: [1,  2], // 差無来！！EX
    2813380119: [2,  2], // BBLLAASSTT!!EX
    1742078218: [3,  2], // ホーンテッド★メイドランチEX
    1059529226: [4,  2], // ちくわパフェだよ☆ＣＫＰEX
    2221384893: [5,  2], // ませまてぃっく♥ま+ま=まじっく！EX
    1851599282: [6,  2], // NINE PIECEEX
    1220267124: [7,  2], // Der Wald(kors k Remix)EX

     683755803: [0,  3], // quaver♪EX
    3731087958: [1,  3], // VersaEX
    1443532859: [2,  3], // FLOWEREX
    2068624877: [3,  3], // バンブーソード・ガールEX
    3024561384: [4,  3], // Pa la la 42EX

     136229258: [0,  4], // ストレイ・マーチEX
    1175081972: [1,  4], // PUNISHEREX
    3266918960: [2,  4], // Craze for YouEX
    3311440669: [3,  4], // 天庭EX
     432117677: [4,  4], // 突然ゴルゴンゾーラEX
    4052944144: [5,  4], // 薔薇は永遠に美しくEX
    4121065135: [6,  4], // KING of the SEAEX
    1836296681: [7,  4], // 背水之陣EX

     812841140: [0,  5], // PITAゴラス☆KISSEX
    1494643004: [1,  5], // 踊るフィーバーロボ　Eu-Robot mixEX
     191579097: [2,  5], // お江戸花吹雪 TEYAN-day MIXEX
    2298832068: [3,  5], // Sweet Sweet ♥ MagicEX
    1591908359: [4,  5], // 螺子之人EX
    3297832513: [5,  5], // たまゆらEX
    3289954481: [6,  5], // Violently CarEX
     330770378: [7,  5], // Votum stellarum -forest #25 RMX-EX

     876050055: [0,  6], // The tyro's reverieEX
    3108028747: [1,  6], // カゲロウEX
    1300572437: [2,  6], // HypArcSin(x)EX
    3969594599: [3,  6], // Manhattan Sports ClubEX
     301018380: [4,  6], // 誰がために陽はのぼるEX
    1452570723: [5,  6], // KIMONO♥PRINCESSEX
    2144266646: [6,  6], // VEX
    1075630345: [7,  6], // ヴェルヴェット　バレットEX

    1750222812: [0,  7], // 白夜幻燈EX
    3620521383: [1,  7], // 怒れる大きな白い馬EX
    1570392232: [2,  7], // デパ地下のお話EX
    2132366691: [3,  7], // BEYOND THE EARTHEX
    1049735923: [4,  7], // 煌-灼熱の裁き-EX
    3705342081: [5,  7], // Maritare!EX
     665309658: [6,  7], // Holy ForestEX
    3635890942: [7,  7], // SqueezeEX

    3033691090: [0,  8], // CleopatrysmEX
    1689883094: [1,  8], // 男々道EX
    3739779305: [2,  8], // スーパーモグーEX
     163277037: [3,  8], // ススメ！少年！！EX
    1298197168: [4,  8], // 情操ディストピアEX
    3467562394: [5,  8], // Ge-Ko-Ku-JoEX
    1323258036: [6,  8], // 己経忍不住了EX
    2606273468: [7,  8], // Little prayerEX

    1927950204: [0,  9], // 天庭 おとこのこ編EX
    3339368412: [1,  9], // 文明開化EX
    1416127157: [2,  9], // 神曲EX
    1056378476: [3,  9], // なまいきプリンセスEX
    1278567396: [4,  9], // 断罪プラズマEX
    3644930852: [5,  9], // Princess RokiEX

    2702158770: [0, 10], // ポルターガイストEX
     940755002: [1, 10], // CelsusEX
    2236031784: [2, 10], // 恋する☆宇宙戦争っ！！EX
    3797225409: [3, 10], // フリーパスEX
     701658512: [4, 10], // In The RuinsEX
    3715694007: [5, 10], // DOES NOT COMPUTEEX
     852843193: [6, 10], // I'm so HappyEX
    2827803919: [7, 10], // 月光蝶EX

    4239801185: [0, 11], // ATTRACTION！EX
     461939814: [1, 11], // 1/6billionthEX
    1034198295: [2, 11], // 真超深ＴＩＯＮEX

     865911839: [0, 12], // RomanceEX

     554357215: [0, 13], // 彼女は快刀乱麻EX
    1708395143: [1, 13], // ムーニャポヨポヨスッポコニャーゴEX
    1281216099: [2, 13], // 暴レ焔EX
    1314585942: [3, 13], // 猫侍の逆襲EX
    3975902536: [4, 13], // Russian Caravan RhapsodyEX
  },
  48: {
     455383983: [0,  0], // 創世ノートEX
    1603274361: [1,  0], // 雪上断火EX
    3758296137: [2,  0], // バイキングマンEX
    3305751667: [3,  0], // Red RosesEX
    4108355885: [4,  0], // アストライアの双皿EX
    2518174756: [5,  0], // ULTRA BUTTERFLY(坤剛力)EX
    4254525225: [6,  0], // 序EX

    4135728243: [0,  1], // VairocanaEX
    3493131673: [1,  1], // 悲しいねEX
    4059694103: [2,  1], // OVERHEAT -Type P-EX
    2076935896: [3,  1], // STULTIEX
     684233654: [4,  1], // 御千手メディテーションEX
    3119937608: [5,  1], // GAIAEX
    4185553377: [6,  1], // 背水之陣 (Kagutsuchi Remix)EX
    3106237956: [7,  1],  // コドモライブEX

    3076747043: [0,  2], // NOBUNAGAEX
     117566132: [1,  2], // MetamorphoseEX

     343624445: [0,  3], // 背徳と邪悪のエピタフEX
    3659731550: [1,  3], // MacuilxochitlEX
    2940529819: [2,  3], // ZADAMGAEX
    2553007883: [3,  3], // hora de verdadEX
    2364902686: [4,  3], // 火風陸空EX
     629641485: [5,  3], // Concertino In BlueEX
     175768542: [6,  3], // 灼熱Beach Side BunnyEX
    2575513966: [7,  3], // 踊るフィーバーロボEX

     945316102: [0,  4], // CHIP'N'RIDDIMEX
    2655175138: [1,  4], // BabeL 〜Grand Story〜EX
    2542141758: [2,  4], // EvansEX
    3922491939: [3,  4], // DDR MEGAMIXEX

    1300006075: [0,  5], // 進め！爺ちゃん！EX
    2346407776: [1,  5], // カラルの月EX
    3598920757: [2,  5], // JOMANDAEX
    1289388424: [3,  5], // Dimensiva VulnusEX
    1333262048: [4,  5], // 金縛りの逢をEX
    1441182494: [5,  5], // ValangaEX
     346278190: [6,  5], // IdolaEX
    2252077555: [7,  5], // Sanctum CrusadeEX

     125613504: [0,  6], // fffffEX
    1558628253: [1,  6], // ZETA〜素数の世界と超越者〜EX
    2184839272: [2,  6], // EsperanzaEX
    1222206625: [3,  6], // 万物快楽理論EX
    2712574320: [4,  6], // fffff op.2EX

    3656158409: [0,  7], // ErgosphereEX
    2255205738: [1,  7], // ConcertareHYPER
    2991097045: [2,  7], // 雫EX
    3604999232: [3,  7], // Doll's sightEX
    1576654326: [4,  7], // 夜間行EX
    1146853845: [5,  7], // 夢について　TYPE CEX
    1979832771: [6,  7], // 風林火山EX
    1496327685: [7,  7], // 海神EX

    1741704478: [0,  8], // 生きてこそ〜特別版〜EX
    2774222181: [1,  8], // 野獣ワイルドEX
    1883484033: [2,  8], // Southern CrossEX
    1145202847: [3,  8], // 蛇神EX
    1421842409: [4,  8], // 西軍||∴⊂SEKIGAHARA⊃∴||東軍EX
    2633254850: [5,  8], // 轟け！恋のビーンボール！！EX
    1870052516: [6,  8], // カーニバルの主題による人形のためのいびつな狂想曲EX
    3433366360: [7,  8], // 量子の海のリントヴルムEX

    2071636006: [0,  9], // 一激必翔EX
     297909994: [1,  9], // MVAEX
    1489981950: [2,  9], // True BlueEX
     139352566: [3,  9], // The Least 100 secEX

    1032817123: [0, 10], // ChronoxiaEX
  },
  49: {
    1360993087: [829, 117], // uenEX
    4171543170: [230, 154], // BabeL 〜Next Story〜EX
    1448931645: [150, 168], // neuEX

    1001339082: [511, 289], // ZirkfiedEX
    3991980209: [670, 319], // RINИEEX

    1657755463: [390, 389], // 生命の焔纏いてEX
       2722036: [431, 393], // C18H27NO3EX
    4175681001: [109, 393], // UbertreffenEX
    1931539383: [472, 400], // 終末を追う者EX
    1771349676: [709, 400], // Hell? or Heaven?EX
    1284384708: [550, 420], // Elemental CreationEX

     286082925: [749, 460], // 想い出をありがとうEX
    2356268389: [190, 477], // GeiselhausEX
     972188906: [350, 519], // 天空の夜明けEX

    3067949143: [630, 577], // QuoNEX
    1464743628: [270, 606], // RemainEX
    3890933150: [789, 622], // GALAXY FOREST 11.6&12EX
     483406270: [ 69, 623], // ブタパンチのテーマEX
    1720933628: [310, 666], // Eine Haube 〜聖地の果てにあるもの〜EX
    1296684325: [590, 706], // IXEX
  }
};
