var position = {
  47: {
    x: {
      start: 96,
      size: 50,
      gap: 30 
    },
    y: {
      pos: [215, 295, 372, 448, 534, 614, 694, 774, 854, 933, 1013, 1093, 1175, 1255],
      size: 50
    }
  },
  48: {
    x: {
      start: 95,
      size: 50,
      gap: 30
    },
    y: {
      pos: [134, 215, 295, 375, 456, 535, 615, 695, 775, 855, 935],
      size: 50
    }
  }
};

var song_position = {
  47: {
    1667142875: [0,  0], // MynarcoEX
    1016166255: [1,  0], // chilblainEX
    1070308542: [2,  0], // Dogu DittyEX
    285808417:  [3,  0], // へんたいトリロジーEX
    2550906931: [4,  0], // StoriesEX
    2909291949: [5,  0], // この子の七つのお祝いにEX
    2945732184: [6,  0], // 猿の経EX
    711438224:  [7,  0], // ミサコの日記（見ちゃダメ！）EX

    650530290:  [0,  1], // でんがなマンガナEX
    1997864116: [1,  1], // αρχηEX
    902016413:  [2,  1], // 永遠という名の媚薬EX
    43679469:   [3,  1], // 龍と少女とデコヒーレンスEX
    275108854:  [4,  1], // うたEX
    2126067246: [5,  1], // For Dear 〜EX
    2126819391: [6,  1], // AmalgamationEX
    3604178582: [7,  1], // full-consciousness greenEX

    433576325:  [0,  2], // お米の美味しい炊き方、そしてお米を食べることによるその効果。EX
    34685774:   [1,  2], // 差無来！！EX
    2813380119: [2,  2], // BBLLAASSTT!!EX
    1742078218: [3,  2], // ホーンテッド★メイドランチEX
    1059529226: [4,  2], // ちくわパフェだよ☆ＣＫＰEX
    2221384893: [5,  2], // ませまてぃっく♥ま+ま=まじっく！EX
    1851599282: [6,  2], // NINE PIECEEX
    1220267124: [7,  2], // Der Wald(kors k Remix)EX

    683755803:  [0,  3], // quaver♪EX
    3731087958: [1,  3], // VersaEX
    1443532859: [2,  3], // FLOWEREX
    2068624877: [3,  3], // バンブーソード・ガールEX
    3024561384: [4,  3], // Pa la la 42EX

    136229258:  [0,  4], // ストレイ・マーチEX
    1175081972: [1,  4], // PUNISHEREX
    3266918960: [2,  4], // Craze for YouEX
    3311440669: [3,  4], // 天庭EX
    432117677:  [4,  4], // 突然ゴルゴンゾーラEX
    4052944144: [5,  4], // 薔薇は永遠に美しくEX
    4121065135: [6,  4], // KING of the SEAEX
    1836296681: [7,  4], // 背水之陣EX

    812841140:  [0,  5], // PITAゴラス☆KISSEX
    1494643004: [1,  5], // 踊るフィーバーロボ　Eu-Robot mixEX
    191579097:  [2,  5], // お江戸花吹雪 TEYAN-day MIXEX
    2298832068: [3,  5], // Sweet Sweet ♥ MagicEX
    1591908359: [4,  5], // 螺子之人EX
    3297832513: [5,  5], // たまゆらEX
    3289954481: [6,  5], // Violently CarEX
    330770378:  [7,  5], // Votum stellarum -forest #25 RMX-EX

    876050055:  [0,  6], // The tyro's reverieEX
    3108028747: [1,  6], // カゲロウEX
    1300572437: [2,  6], // HypArcSin(x)EX
    3969594599: [3,  6], // Manhattan Sports ClubEX
    301018380:  [4,  6], // 誰がために陽はのぼるEX
    1452570723: [5,  6], // KIMONO♥PRINCESSEX
    2144266646: [6,  6], // VEX
    1075630345: [7,  6], // ヴェルヴェット　バレットEX

    1750222812: [0,  7], // 白夜幻燈EX
    3620521383: [1,  7], // 怒れる大きな白い馬EX
    1570392232: [2,  7], // デパ地下のお話EX
    2132366691: [3,  7], // BEYOND THE EARTHEX
    1049735923: [4,  7], // 煌-灼熱の裁き-EX
    3705342081: [5,  7], // Maritare!EX
    665309658:  [6,  7], // Holy ForestEX
    3635890942: [7,  7], // SqueezeEX

    3033691090: [0,  8], // CleopatrysmEX
    1689883094: [1,  8], // 男々道EX
    3739779305: [2,  8], // スーパーモグーEX
    163277037:  [3,  8], // ススメ！少年！！EX
    1298197168: [4,  8], // 情操ディストピアEX
    3467562394: [5,  8], // Ge-Ko-Ku-JoEX
    1323258036: [6,  8], // 己経忍不住了EX
    2606273468: [7,  8], // Little prayerEX

    1927950204: [0,  9], // 天庭 おとこのこ編EX
    3339368412: [1,  9], // 文明開化EX
    1416127157: [2,  9], // 神曲EX
    1056378476: [3,  9], // なまいきプリンセスEX
    1278567396: [4,  9], // 断罪プラズマEX
    3644930852: [5,  9], // Princess RokiEX

    2702158770: [0, 10], // ポルターガイストEX
    940755002:  [1, 10], // CelsusEX
    2236031784: [2, 10], // 恋する☆宇宙戦争っ！！EX
    3797225409: [3, 10], // フリーパスEX
    701658512:  [4, 10], // In The RuinsEX
    3715694007: [5, 10], // DOES NOT COMPUTEEX
    852843193:  [6, 10], // I'm so HappyEX
    2827803919: [7, 10], // 月光蝶EX

    4239801185: [0, 11], // ATTRACTION！EX
    461939814:  [1, 11], // 1/6billionthEX
    1034198295: [2, 11], // 真超深ＴＩＯＮEX

    865911839:  [0, 12], // RomanceEX

    554357215:  [0, 13]  // 彼女は快刀乱麻EX
  },
  48: {
    455383983:  [0,  0], // 創世ノートEX
    1603274361: [1,  0], // 雪上断火EX
    3758296137: [2,  0], // バイキングマンEX
    3305751667: [3,  0], // Red RosesEX
    4108355885: [4,  0], // アストライアの双皿EX
    2518174756: [5,  0], // ULTRA BUTTERFLY(坤剛力)EX
    4254525225: [6,  0], // 序EX

    4135728243: [0,  1], // VairocanaEX
    3493131673: [1,  1], // 悲しいねEX
    4059694103: [2,  1], // OVERHEAT -Type P-EX
    2076935896: [3,  1], // STULTIEX
    684233654:  [4,  1], // 御千手メディテーションEX
    3119937608: [5,  1], // GAIAEX
    4185553377: [6,  1], // 背水之陣 (Kagutsuchi Remix)EX
    3106237956: [7,  1],  // コドモライブEX

    3076747043: [0,  2], // NOBUNAGAEX
    117566132:  [1,  2], // MetamorphoseEX

    343624445:  [0,  3], // 背徳と邪悪のエピタフEX
    3659731550: [1,  3], // MacuilxochitlEX
    2940529819: [2,  3], // ZADAMGAEX
    2553007883: [3,  3], // hora de verdadEX
    2364902686: [4,  3], // 火風陸空EX
    629641485:  [5,  3], // Concertino In BlueEX
    175768542:  [6,  3], // 灼熱Beach Side BunnyEX
    2575513966: [7,  3], // 踊るフィーバーロボEX

    945316102:  [0,  4], // CHIP'N'RIDDIMEX
    2655175138: [1,  4], // BabeL 〜Grand Story〜EX
    2542141758: [2,  4], // EvansEX
    3922491939: [3,  4], // DDR MEGAMIXEX

    1300006075: [0,  5], // 進め！爺ちゃん！EX
    2346407776: [1,  5], // カラルの月EX
    3598920757: [2,  5], // JOMANDAEX
    1289388424: [3,  5], // Dimensiva VulnusEX
    1333262048: [4,  5], // 金縛りの逢をEX
    1441182494: [5,  5], // ValangaEX
    346278190:  [6,  5], // IdolaEX
    2252077555: [7,  5], // Sanctum CrusadeEX

    125613504:  [0,  6], // fffffEX
    1558628253: [1,  6], // ZETA〜素数の世界と超越者〜EX
    2184839272: [2,  6], // EsperanzaEX
    1222206625: [3,  6], // 万物快楽理論EX
    2712574320: [4,  6], // fffff op.2EX

    3656158409: [0,  7], // ErgosphereEX
    2255205738: [1,  7], // ConcertareHYPER
    2991097045: [2,  7], // 雫EX
    3604999232: [3,  7], // Doll's sightEX
    1576654326: [4,  7], // 夜間行EX
    1146853845: [5,  7], // 夢について　TYPE CEX
    1979832771: [6,  7], // 風林火山EX
    1496327685: [7,  7], // 海神EX

    1741704478: [0,  8], // 生きてこそ〜特別版〜EX
    2774222181: [1,  8], // 野獣ワイルドEX
    1883484033: [2,  8], // Southern CrossEX
    1145202847: [3,  8], // 蛇神EX
    1421842409: [4,  8], // 西軍||∴⊂SEKIGAHARA⊃∴||東軍EX
    2633254850: [5,  8], // 轟け！恋のビーンボール！！EX
    1870052516: [6,  8], // カーニバルの主題による人形のためのいびつな狂想曲EX
    3433366360: [7,  8], // 量子の海のリントヴルムEX

    2071636006: [0,  9], // 一激必翔EX
    297909994:  [1,  9], // MVAEX
    1489981950: [2,  9], // True BlueEX
    139352566:  [3,  9], // The Least 100 secEX

    1032817123: [0, 10]  // ChronoxiaEX
  },
  49: {
    1360993087: [829, 117], // uenEX
    4171543170: [230, 154], // BabeL 〜Next Story〜EX
    1448931645: [150, 168], // neuEX

    1001339082: [511, 289], // ZirkfiedEX
    3991980209: [670, 319], // RINИEEX

    1657755463: [390, 389], // 生命の焔纏いてEX
    2722036:    [431, 393], // C18H27NO3EX
    4175681001: [109, 393], // UbertreffenEX
    1931539383: [472, 400], // 終末を追う者EX
    1771349676: [709, 400], // Hell? or Heaven?EX
    1284384708: [550, 420], // Elemental CreationEX

    286082925:  [749, 460], // 想い出をありがとうEX
    2356268389: [190, 477], // GeiselhausEX
    972188906:  [350, 519], // 天空の夜明けEX

    3067949143: [630, 577], // QuoNEX
    1464743628: [270, 606], // RemainEX
    3890933150: [789, 622], // GALAXY FOREST 11.6&12EX
    483406270:  [ 69, 623], // ブタパンチのテーマEX
    1720933628: [310, 666], // Eine Haube 〜聖地の果てにあるもの〜EX
    1296684325: [590, 706]  // IXEX
  }
};
